import re
import json

if __name__ == "__main__":
    test_dataset = [{
        "left": 'JN592366411120131578800000000000000190000000083423906WpAa6p3RSN09V52k8TRKhA==:**********:2:2:1:(A)*統一麥香紅茶TP300:1:10:',
        "right": '***統一麥香紅茶TP375:1:15'
    },
        {
        "left": 'KF4893731611201304106000005a6000005ee8346876070824891lbZ1hoTRcgJoptmjj+yUjg==:**:1:1:1:咖啡廳Coffee Shops & Tea Salons:1:1518',
        "right": '**'
    },
        {
        "left": 'GZ0940167211112284739000001060000011300000000247520163yCVgFqGFcGnrHUi2A/x8g==:**********:2:2:1:經典特調冷萃V:1:185:烤雞生吐司三明治:1:90',
        "right": '**'
    },
        {
        "left": 'KE2842452511201233867000005f9000006450000000054918921wzpfL4zpsviBN1vzGKvqKQ==:**********:3:22:1',
        "right": '**'
    }]